#!/bin/sh

# 注：以‘#’开头的行为注释行

echo "-------------------------------------------------------------------------------"
echo "-----------------------欢迎使用CSDN博客目录生成工具(GCCL)----------------------"
echo "                         _____   _____   _____  _      "
echo "                        / ____| / ____| / ____|| |     "
echo "                       | |  __ | |     | |     | |     "
echo "                       | | |_ || |     | |     | |     "
echo "                       | |__| || |____ | |____ | |____ "
echo "                        \_____| \_____| \_____||______|"
echo "                                                      "
#echo "                                                      "
echo "该工具可为您生成“CSDN博客导航目录”,使用前请阅读README,然后按照提示进行操作。"
echo "如果在使用过程中遇到问题，可到 https://github.com/yansheng836/GCCL/issues 提问。"
echo "-------------------------------------------------------------------------------"
echo "-------------------------------------------------------------------------------"
echo "！！！！！！！！！！！！！！！！！声明：！！！！！！！！！！！！！！！！！！！"
echo "该工具仅供学习交流使用，请勿用于商业用途；该工具是完全免费的，不进行任何保证，"
echo "版权归 sheng.yan836@gmail.com 所有。"
echo "-------------------------------------------------------------------------------"

# 主要命令：运行jar。
java -jar ./GCCL-1.1.2-SNAPSHOT.jar
